assets/soap_samples/use_case_2.xml

<soapenv:Envelope xmlns:ser="http://api-demo.temando.com/schema/2009_06/server.xsd"
                  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <Security>
            <UsernameToken>
                <Username>username</Username>
                <Password>password</Password>
            </UsernameToken>
        </Security>
    </soapenv:Header>
    <soapenv:Body>
        <ser:getQuotes>
            <anythings>
                <anything>
                    <class>Freight</class>
                    <mode>Less than load</mode>
                    <packaging>Box</packaging>
                    <distanceMeasurementType>Centimetres</distanceMeasurementType>
                    <weightMeasurementType>Grams</weightMeasurementType>
                    <length>18</length>
                    <width>23</width>
                    <height>16</height>
                    <weight>180</weight>
                    <packagingOptimisation>Y</packagingOptimisation>
                    <quantity>1</quantity>
                    <articles>
                        <article>
                            <description>Baby Pooh Led Magic Night Light</description>
                            <sku>6767508</sku>
                        </article>
                    </articles>
                </anything>
                <anything>
                    <class>Freight</class>
                    <mode>Less than load</mode>
                    <packaging>Box</packaging>
                    <distanceMeasurementType>Centimetres</distanceMeasurementType>
                    <weightMeasurementType>Grams</weightMeasurementType>
                    <length>7</length>
                    <width>10</width>
                    <height>25</height>
                    <weight>210</weight>
                    <packagingOptimisation>Y</packagingOptimisation>
                    <quantity>1</quantity>
                    <articles>
                        <article>
                            <description>Winnie the Pooh Starry Night Cuddle Robe</description>
                            <sku>3639911</sku>
                        </article>
                    </articles>
                </anything>
            </anythings>
            <anywhere>
                <itemNature>Domestic</itemNature>
                <itemMethod>Door to Door</itemMethod>
                <originCountry>AU</originCountry>
                <originCode>3152</originCode>
                <originSuburb>WANTIRNA SOUTH</originSuburb>
                <originIs>Business</originIs>
                <destinationCountry>AU</destinationCountry>
                <destinationCode>3756</destinationCode>
                <destinationSuburb>Wallan</destinationSuburb>
                <destinationIs>Residence</destinationIs>
            </anywhere>
            <general>
                <goodsValue>72.96</goodsValue>
            </general>
            <clientId>27937</clientId>
            <quoteFilter>
                <preference>Carriers Only</preference>
                <carriers>
                    <carrier>
                        <carrierId>54381</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>54427</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>54428</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>54426</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>54359</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>60005</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>60006</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>60046</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>60037</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>60032</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>54410</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>54453</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>54425</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>60052</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>60053</carrierId>
                    </carrier>
                    <carrier>
                        <carrierId>60314</carrierId>
                    </carrier>
                </carriers>
            </quoteFilter>
        </ser:getQuotes>
    </soapenv:Body>
</soapenv:Envelope>